""" 音乐风格 """

music_style = {
            u'电子': {'style': '%E7%94%B5%E5%AD%90',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', u'李玉刚', u'陈鸿宇', u'陈一发儿',
                                       u'鹿先森乐队', u'戴荃', u'周深', u'王力宏', u'逃跑计划', u'宋冬野', u'郭旭', u'陈奕迅',
                                       u'牛奶咖啡', u'马頔', u'任素汐', u'林宥嘉', u'青蛙', u'蔡健雅', u'吴亦凡', u'陈粒',
                                       u'苏打绿', u'阿桑', u'赵浴辰', u'华晨宇', u'孙燕姿', u'朴树', u'谢安琪', u'李志',
                                       u'齐一', u'满汉全席', u'宋冬野', u'南征北战', u'海龟先生', u'金玟岐', u'杨宗纬', u'鹏泊',
                                       u'谢春花', u'李荣浩', u'林俊杰', u'TFBOYS', u'GALA']
                   },
            u'ACG': {'style': 'ACG',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', u'Alan Walker', u'李玉刚', u'陈一发儿',
                                       u'宋冬野', u'王力宏', u'逃跑计划', u'陈奕迅', u'青蛙', u'满汉全席', u'蔡健雅',
                                       u'任素汐', u'苏打绿', u'阿桑', u'PDD', u'孙燕姿', u'华晨宇', u'朴树', u'乔任梁',
                                       u'南征北战', u'金玟岐', u'齐一', u'陈粒', u'杨宗纬', u'许镜清', u'林俊杰', u'吴亦凡',
                                       u'韩安旭', u'那英', u'徐梦圆', u'金南玲', u'廖佳琳', u'TFBOYS', u'毛毛', u'夏天Alex',
                                       u'许巍', u'约瑟翰庞麦郎', u'刘思涵', u'王菲', u'王笑文', u'Amy Chanrich', u'李荣浩',
                                       u'BIGBANG', u'李志', u'杨千嬅', u'群星', u'周二珂', u'GALA', u'女孩为何穿短裙', u'庄心妍'
                                        , u'徐佳莹', u'汪苏泷', u'派伟俊', u'陈小春', u'张赫宣', u'梁汉文', u'雷军', u'张赫宣'
                                        , u'胡夏', u'上海彩虹室内合唱团', u'张敬轩', u'麦振鸿', u'双笙', u'曲锦楠', u'崔子格',
                                       u'南拳妈妈', u'朱主爱', u'郝云', u'黄龄', u'陈势安', u'刘涛', u'陈洁仪', u'赵照',
                                       u'晓月老板', u'白智英', u'杜雯媞', u'方大同', u'筷子兄弟', u'鹿晗', u'王绎龙', u'艾索',
                                       u'杨洋', u'陈学冬', u'陈鸿宇', u'G.E.M.邓紫棋', u'HITA', u'张碧晨', u'伍佰', u'邓超',
                                       u'囧菌', u'王强', u'森冬', u'咖啡少年', u'以冬', u'张伟进', u'卢巧音', u'胡彦斌'
                                        , u'张在仁', u'秦基博', u'叶洛洛', u'罗凯楠', u'蔡依林', u'张芸京', u'蓝沁',
                                       u'青鸟飞鱼', u'回音哥', u'량현량하', u'金志文', u'张韶涵', u'不才', u'陈绮贞']
                    },
            u'轻音乐': {'style': '%E8%BD%BB%E9%9F%B3%E4%B9%90',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', u'李玉刚', u'Alan Walker', u'陈鸿宇',
                                       u'鹿先森乐队', u'GALA', u'云雀合唱团', u'陈一发儿', u'戴荃', u'周深', u'宋冬野',
                                       u'逃跑计划', u'金玟岐', u'Jam', u'GARNiDELiA', u'陈奕迅', u'马頔', u'赵浴辰',
                                       u'任素汐', u'林宥嘉', u'牛奶咖啡', u'蔡健雅', u'郭旭', u'青蛙', u'陈粒', u'苏打绿'
                                        , u'和田光司', u'阿桑', u'孙燕姿', u'谢安琪', u'朴树', u'李志', u'丢火车', u'海龟先生'
                                        , u'李荣浩', u'Maroon 5', u'满汉全席', u'乔任梁', u'齐一', u'谢春花', u'Beyond']
                    },
            u'治愈': {'style': '%E6%B2%BB%E6%84%88',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', u'李玉刚', u'Alan Walker', u'陈鸿宇',
                                       u'鹿先森乐队', u'GALA', u'云雀合唱团', u'陈一发儿', u'戴荃', u'周深', u'宋冬野',
                                       u'逃跑计划', u'金玟岐', u'Jam', u'GARNiDELiA', u'陈奕迅', u'马頔', u'赵浴辰',
                                       u'任素汐', u'林宥嘉', u'牛奶咖啡', u'蔡健雅', u'郭旭', u'青蛙', u'陈粒', u'苏打绿'
                                        , u'和田光司', u'阿桑', u'孙燕姿', u'谢安琪', u'朴树', u'李志', u'丢火车', u'海龟先生'
                                        , u'李荣浩', u'Maroon 5', u'满汉全席', u'乔任梁', u'齐一', u'谢春花', u'Beyond']
                   },
        }
