""" 音乐风格 """

music_style = {
            u'电子': {'style': '%E7%94%B5%E5%AD%90',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', u'李玉刚', u'陈一发儿',
                                       u'宋冬野', u'王力宏', u'逃跑计划', u'陈奕迅', u'青蛙', u'满汉全席', u'蔡健雅',
                                       u'任素汐', u'苏打绿', u'阿桑', u'孙燕姿', u'华晨宇', u'朴树', u'乔任梁',
                                       u'南征北战', u'金玟岐', u'齐一', u'陈粒', u'杨宗纬', u'许镜清', u'林俊杰', u'吴亦凡',
                                       u'韩安旭', u'那英', u'徐梦圆', u'金南玲', u'廖佳琳', 'TFBOYS', u'毛毛', u'夏天Alex',
                                       u'许巍', u'约瑟翰庞麦郎', u'刘思涵', u'王菲', u'王笑文', u'李荣浩', 'RADWIMPS'
                                       'BIGBANG', u'李志', u'杨千嬅', u'群星', u'周二珂', 'GALA', u'女孩为何穿短裙', u'庄心妍'
                                        , u'徐佳莹', u'汪苏泷', u'派伟俊', u'陈小春', u'张赫宣', u'梁汉文', u'雷军', u'张赫宣'
                                        , u'胡夏', u'上海彩虹室内合唱团', u'张敬轩', u'麦振鸿', u'双笙', u'曲锦楠', u'崔子格',
                                       u'南拳妈妈', u'朱主爱', u'郝云', u'黄龄', u'陈势安', u'刘涛', u'陈洁仪', u'赵照',
                                       u'晓月老板', u'白智英', u'杜雯媞', u'方大同', u'筷子兄弟', u'鹿晗', u'王绎龙', u'艾索',
                                       u'杨洋', u'陈学冬', u'陈鸿宇', u'G.E.M.邓紫棋', 'HITA', u'张碧晨', u'伍佰', u'邓超',
                                       u'囧菌', u'王强', u'森冬', u'咖啡少年', u'以冬', u'张伟进', u'卢巧音', u'胡彦斌'
                                        , u'张在仁', u'秦基博', u'叶洛洛', u'罗凯楠', u'蔡依林', u'张芸京', u'蓝沁',
                                       u'青鸟飞鱼', u'回音哥', u'량현량하', u'金志文', u'张韶涵', u'不才', u'陈绮贞',
                                       'Pianoboy', u'张栋梁', u'般禅梵唱妙音组', u'周传雄', u'网易云音乐', u'容祖儿', u'费玉清',
                                       u'海鸣威', u'高迪', u'苏运莹', u'齐晨', u'胡歌', u'谢安琪', u'曲婉婷', u'卢冠廷', u'王蓝茵',
                                       u'刘惜君', u'任然', u'魏新雨', u'方雅贤', u'后弦', u'中国人民解放军军乐团', u'脸红的思春期',
                                       'GARNiDELiA', u'戴荃', u'周深', u'牛奶咖啡']
                   },
            u'ACG': {'style': 'ACG',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', 'Alan Walker', u'李玉刚', u'陈一发儿',
                                       u'宋冬野', u'王力宏', u'逃跑计划', u'陈奕迅', u'青蛙', u'满汉全席', u'蔡健雅',
                                       u'任素汐', u'苏打绿', u'阿桑', 'PDD', u'孙燕姿', u'华晨宇', u'朴树', u'乔任梁',
                                       u'南征北战', u'金玟岐', u'齐一', u'陈粒', u'杨宗纬', u'许镜清', u'林俊杰', u'吴亦凡',
                                       u'韩安旭', u'那英', u'徐梦圆', u'金南玲', u'廖佳琳', 'TFBOYS', u'毛毛', u'夏天Alex',
                                       u'许巍', u'约瑟翰庞麦郎', u'刘思涵', u'王菲', u'王笑文', 'Amy Chanrich', u'李荣浩',
                                       'BIGBANG', u'李志', u'杨千嬅', u'群星', u'周二珂', 'GALA', u'女孩为何穿短裙', u'庄心妍'
                                        , u'徐佳莹', u'汪苏泷', u'派伟俊', u'陈小春', u'张赫宣', u'梁汉文', u'雷军', u'张赫宣'
                                        , u'胡夏', u'上海彩虹室内合唱团', u'张敬轩', u'麦振鸿', u'双笙', u'曲锦楠', u'崔子格',
                                       u'南拳妈妈', u'朱主爱', u'郝云', u'黄龄', u'陈势安', u'刘涛', u'陈洁仪', u'赵照',
                                       u'晓月老板', u'白智英', u'杜雯媞', u'方大同', u'筷子兄弟', u'鹿晗', u'王绎龙', u'艾索',
                                       u'杨洋', u'陈学冬', u'陈鸿宇', u'G.E.M.邓紫棋', 'HITA', u'张碧晨', u'伍佰', u'邓超',
                                       u'囧菌', u'王强', u'森冬', u'咖啡少年', u'以冬', u'张伟进', u'卢巧音', u'胡彦斌'
                                        , u'张在仁', u'秦基博', u'叶洛洛', u'罗凯楠', u'蔡依林', u'张芸京', u'蓝沁',
                                       u'青鸟飞鱼', u'回音哥', u'량현량하', u'金志文', u'张韶涵', u'不才', u'陈绮贞', 'Pianoboy'
                                        , u'张栋梁', u'般禅梵唱妙音组', u'周传雄', u'网易云音乐', u'容祖儿', u'费玉清',
                                       u'海鸣威', u'高迪', u'苏运莹', u'齐晨', u'胡歌', u'谢安琪', u'曲婉婷', u'卢冠廷', u'王蓝茵',
                                       u'刘惜君', u'任然', u'魏新雨', u'方雅贤', u'后弦', u'中国人民解放军军乐团', u'脸红的思春期',
                                       'Charlie Puth']
                    },
            u'轻音乐': {'style': '%E8%BD%BB%E9%9F%B3%E4%B9%90',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', 'Alan Walker', u'李玉刚', u'陈一发儿',
                                       u'宋冬野', u'王力宏', u'逃跑计划', u'陈奕迅', u'青蛙', u'满汉全席', u'蔡健雅',
                                       u'任素汐', u'苏打绿', u'阿桑', 'PDD', u'孙燕姿', u'华晨宇', u'朴树', u'乔任梁',
                                       u'南征北战', u'金玟岐', u'齐一', u'陈粒', u'杨宗纬', u'许镜清', u'林俊杰', u'吴亦凡',
                                       u'韩安旭', u'那英', u'徐梦圆', u'金南玲', u'廖佳琳', 'TFBOYS', u'毛毛', u'夏天Alex',
                                       u'许巍', u'约瑟翰庞麦郎', u'刘思涵', u'王菲', u'王笑文', 'Amy Chanrich', u'李荣浩',
                                       'BIGBANG', u'李志', u'杨千嬅', u'群星', u'周二珂', 'GALA', u'女孩为何穿短裙', u'庄心妍'
                                        , u'徐佳莹', u'汪苏泷', u'派伟俊', u'陈小春', u'张赫宣', u'梁汉文', u'雷军', u'张赫宣'
                                        , u'胡夏', u'上海彩虹室内合唱团', u'张敬轩', u'麦振鸿', u'双笙', u'曲锦楠', u'崔子格',
                                       u'南拳妈妈', u'朱主爱', u'郝云', u'黄龄', u'陈势安', u'刘涛', u'陈洁仪', u'赵照',
                                       u'晓月老板', u'白智英', u'杜雯媞', u'方大同', u'筷子兄弟', u'鹿晗', u'王绎龙', u'艾索',
                                       u'杨洋', u'陈学冬', u'陈鸿宇', u'G.E.M.邓紫棋', 'HITA', u'张碧晨', u'伍佰', u'邓超',
                                       u'囧菌', u'王强', u'森冬', u'咖啡少年', u'以冬', u'张伟进', u'卢巧音', u'胡彦斌'
                                        , u'张在仁', u'秦基博', u'叶洛洛', u'罗凯楠', u'蔡依林', u'张芸京', u'蓝沁',
                                       u'青鸟飞鱼', u'回音哥', u'량현량하', u'金志文', u'张韶涵', u'不才', u'陈绮贞',
                                       u'张栋梁', u'般禅梵唱妙音组', u'周传雄', u'网易云音乐', u'容祖儿', u'费玉清',
                                       u'海鸣威', u'高迪', u'苏运莹', u'齐晨', u'胡歌', u'谢安琪', u'曲婉婷', u'卢冠廷', u'王蓝茵',
                                       u'刘惜君', u'任然', u'魏新雨', u'方雅贤', u'后弦', u'中国人民解放军军乐团', u'脸红的思春期',
                                       'GARNiDELiA', u'戴荃', u'周深']
                    },
            u'治愈': {'style': '%E6%B2%BB%E6%84%88',
                     'filter_singer': [u'周杰伦', u'薛之谦', u'许嵩', u'赵雷', 'Alan Walker', u'李玉刚', u'陈一发儿',
                                       u'宋冬野', u'王力宏', u'逃跑计划', u'陈奕迅', u'青蛙', u'满汉全席', u'蔡健雅',
                                       u'任素汐', u'苏打绿', u'阿桑', 'PDD', u'孙燕姿', u'华晨宇', u'朴树', u'乔任梁',
                                       u'南征北战', u'金玟岐', u'齐一', u'陈粒', u'杨宗纬', u'许镜清', u'林俊杰', u'吴亦凡',
                                       u'韩安旭', u'那英', u'徐梦圆', u'金南玲', u'廖佳琳', 'TFBOYS', u'毛毛', u'夏天Alex',
                                       u'许巍', u'约瑟翰庞麦郎', u'刘思涵', u'王菲', u'王笑文', 'Amy Chanrich', u'李荣浩',
                                       'BIGBANG', u'李志', u'杨千嬅', u'群星', u'周二珂', 'GALA', u'女孩为何穿短裙', u'庄心妍'
                                        , u'徐佳莹', u'汪苏泷', u'派伟俊', u'陈小春', u'张赫宣', u'梁汉文', u'雷军', u'张赫宣'
                                        , u'胡夏', u'上海彩虹室内合唱团', u'张敬轩', u'麦振鸿', u'双笙', u'曲锦楠', u'崔子格',
                                       u'南拳妈妈', u'朱主爱', u'郝云', u'黄龄', u'陈势安', u'刘涛', u'陈洁仪', u'赵照',
                                       u'晓月老板', u'白智英', u'杜雯媞', u'方大同', u'筷子兄弟', u'鹿晗', u'王绎龙', u'艾索',
                                       u'杨洋', u'陈学冬', u'陈鸿宇', u'G.E.M.邓紫棋', 'HITA', u'张碧晨', u'伍佰', u'邓超',
                                       u'囧菌', u'王强', u'森冬', u'咖啡少年', u'以冬', u'张伟进', u'卢巧音', u'胡彦斌'
                                        , u'张在仁', u'秦基博', u'叶洛洛', u'罗凯楠', u'蔡依林', u'张芸京', u'蓝沁',
                                       u'青鸟飞鱼', u'回音哥', u'량현량하', u'金志文', u'张韶涵', u'不才', u'陈绮贞',
                                       u'张栋梁', u'般禅梵唱妙音组', u'周传雄', u'网易云音乐', u'容祖儿', u'费玉清',
                                       u'海鸣威', u'高迪', u'苏运莹', u'齐晨', u'胡歌', u'谢安琪', u'曲婉婷', u'卢冠廷', u'王蓝茵',
                                       u'刘惜君', u'任然', u'魏新雨', u'方雅贤', u'后弦', u'中国人民解放军军乐团', u'脸红的思春期',
                                       'GARNiDELiA', u'戴荃', u'周深']
                   },
        }
